app/controllers/hello_worlds_controller.rb

SELECT "hello_worlds".* FROM "hello_worlds"
---
  def index
    @hello_worlds = HelloWorld.all

INSERT INTO "hello_worlds" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-02-03 05:40:46.891028"], ["updated_at", "2021-02-03 05:40:46.891028"]]
---
  def create
    @hello_world = HelloWorld.new(hello_world_params)

    respond_to do |format|
      if @hello_world.save

DELETE FROM "hello_worlds" WHERE "hello_worlds"."id" = ?  [["id", 8]]
---
  def destroy
    @hello_world.destroy

SELECT  "hello_worlds".* FROM "hello_worlds" WHERE "hello_worlds"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
    def set_hello_world
      @hello_world = HelloWorld.find(params[:id])